program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.9.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp32, [1, 3, 224, 224]> face_image) {
            tensor<fp32, []> face_image__scaled___y_0 = const()[name = tensor<string, []>("face_image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-7)];
            tensor<fp32, [1, 3, 224, 224]> face_image__scaled__ = mul(x = face_image, y = face_image__scaled___y_0)[name = tensor<string, []>("face_image__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> face_image__biased___y_0 = const()[name = tensor<string, []>("face_image__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1p+0]], [[-0x1p+0]], [[-0x1p+0]]]])];
            tensor<fp32, [1, 3, 224, 224]> face_image__biased__ = add(x = face_image__scaled__, y = face_image__biased___y_0)[name = tensor<string, []>("face_image__biased__")];
            tensor<int32, []> var_7 = const()[name = tensor<string, []>("op_7"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_31 = const()[name = tensor<string, []>("op_31"), val = tensor<int32, [2]>([16, 16])];
            tensor<int32, [2]> var_32 = const()[name = tensor<string, []>("op_32"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> patch_embeds_pad_type_0 = const()[name = tensor<string, []>("patch_embeds_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [4]> patch_embeds_pad_0 = const()[name = tensor<string, []>("patch_embeds_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<string, []> face_image_to_fp16_dtype_0 = const()[name = tensor<string, []>("face_image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [768, 3, 16, 16]> model_vision_model_embeddings_patch_embedding_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_embeddings_patch_embedding_weight_to_fp16"), val = tensor<fp16, [768, 3, 16, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [768]> model_vision_model_embeddings_patch_embedding_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_embeddings_patch_embedding_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1179776)))];
            tensor<fp16, [1, 3, 224, 224]> face_image_to_fp16 = cast(dtype = face_image_to_fp16_dtype_0, x = face_image__biased__)[name = tensor<string, []>("cast_51")];
            tensor<fp16, [1, 768, 14, 14]> patch_embeds_cast_fp16 = conv(bias = model_vision_model_embeddings_patch_embedding_bias_to_fp16, dilations = var_32, groups = var_7, pad = patch_embeds_pad_0, pad_type = patch_embeds_pad_type_0, strides = var_31, weight = model_vision_model_embeddings_patch_embedding_weight_to_fp16, x = face_image_to_fp16)[name = tensor<string, []>("patch_embeds_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 768, 196])];
            tensor<fp16, [1, 768, 196]> var_34_cast_fp16 = reshape(shape = concat_0, x = patch_embeds_cast_fp16)[name = tensor<string, []>("op_34_cast_fp16")];
            tensor<int32, [3]> embeddings_1_perm_0 = const()[name = tensor<string, []>("embeddings_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<fp16, [1, 196, 768]> var_37_to_fp16 = const()[name = tensor<string, []>("op_37_to_fp16"), val = tensor<fp16, [1, 196, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1181376)))];
            tensor<fp16, [1, 196, 768]> embeddings_1_cast_fp16 = transpose(perm = embeddings_1_perm_0, x = var_34_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [1, 196, 768]> input_5_cast_fp16 = add(x = embeddings_1_cast_fp16, y = var_37_to_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1482496)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1484096)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [1, 196, 768]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = model_vision_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1485696)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2665408)))];
            tensor<fp16, [1, 196, 768]> linear_0_cast_fp16 = linear(bias = model_vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2667008)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3846720)))];
            tensor<fp16, [1, 196, 768]> linear_1_cast_fp16 = linear(bias = model_vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3848320)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5028032)))];
            tensor<fp16, [1, 196, 768]> linear_2_cast_fp16 = linear(bias = model_vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_87 = const()[name = tensor<string, []>("op_87"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_88_cast_fp16 = reshape(shape = var_87, x = linear_0_cast_fp16)[name = tensor<string, []>("op_88_cast_fp16")];
            tensor<int32, [4]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_91_cast_fp16 = reshape(shape = var_90, x = linear_1_cast_fp16)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<int32, [4]> var_93 = const()[name = tensor<string, []>("op_93"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_94_cast_fp16 = reshape(shape = var_93, x = linear_2_cast_fp16)[name = tensor<string, []>("op_94_cast_fp16")];
            tensor<int32, [4]> value_1_perm_0 = const()[name = tensor<string, []>("value_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> var_14_to_fp16 = const()[name = tensor<string, []>("op_14_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 196, 12, 64]> mul_0_cast_fp16 = mul(x = var_88_cast_fp16, y = var_14_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = tensor<string, []>("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 196, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = var_91_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 12, 196, 64]> transpose_48 = transpose(perm = transpose_48_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 12, 196, 196]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_48, y = transpose_49)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 196, 196]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 196, 64]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_94_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 12, 196, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = softmax_0_cast_fp16, y = value_1_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_97_perm_0 = const()[name = tensor<string, []>("op_97_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_99 = const()[name = tensor<string, []>("op_99"), val = tensor<int32, [3]>([1, 196, 768])];
            tensor<fp16, [1, 196, 12, 64]> var_97_cast_fp16 = transpose(perm = var_97_perm_0, x = attn_output_1_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, 196, 768]> var_100_cast_fp16 = reshape(shape = var_99, x = var_97_cast_fp16)[name = tensor<string, []>("op_100_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5029632)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6209344)))];
            tensor<fp16, [1, 196, 768]> linear_3_cast_fp16 = linear(bias = model_vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16, x = var_100_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 196, 768]> input_9_cast_fp16 = add(x = input_5_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6210944)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6212544)))];
            tensor<fp16, [1, 196, 768]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = model_vision_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [3072, 768]> model_vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6214144)))];
            tensor<fp16, [3072]> model_vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10932800)))];
            tensor<fp16, [1, 196, 3072]> linear_4_cast_fp16 = linear(bias = model_vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16, weight = model_vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("TANH_APPROXIMATION")];
            tensor<fp16, [1, 196, 3072]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = linear_4_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [768, 3072]> model_vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10939008)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15657664)))];
            tensor<fp16, [1, 196, 768]> linear_5_cast_fp16 = linear(bias = model_vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = model_vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, 196, 768]> input_17_cast_fp16 = add(x = input_9_cast_fp16, y = linear_5_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15659264)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15660864)))];
            tensor<fp16, [1, 196, 768]> hidden_states_7_cast_fp16 = layer_norm(axes = hidden_states_7_axes_0, beta = model_vision_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("hidden_states_7_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15662464)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16842176)))];
            tensor<fp16, [1, 196, 768]> linear_6_cast_fp16 = linear(bias = model_vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16843776)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18023488)))];
            tensor<fp16, [1, 196, 768]> linear_7_cast_fp16 = linear(bias = model_vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18025088)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19204800)))];
            tensor<fp16, [1, 196, 768]> linear_8_cast_fp16 = linear(bias = model_vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [4]> var_144 = const()[name = tensor<string, []>("op_144"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_145_cast_fp16 = reshape(shape = var_144, x = linear_6_cast_fp16)[name = tensor<string, []>("op_145_cast_fp16")];
            tensor<int32, [4]> var_147 = const()[name = tensor<string, []>("op_147"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_148_cast_fp16 = reshape(shape = var_147, x = linear_7_cast_fp16)[name = tensor<string, []>("op_148_cast_fp16")];
            tensor<int32, [4]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_151_cast_fp16 = reshape(shape = var_150, x = linear_8_cast_fp16)[name = tensor<string, []>("op_151_cast_fp16")];
            tensor<int32, [4]> value_3_perm_0 = const()[name = tensor<string, []>("value_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, 196, 12, 64]> mul_1_cast_fp16 = mul(x = var_145_cast_fp16, y = var_14_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 196, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = var_148_cast_fp16)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, 12, 196, 64]> transpose_50 = transpose(perm = transpose_50_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [1, 12, 196, 196]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_50, y = transpose_51)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 196, 196]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> attn_output_5_transpose_x_0 = const()[name = tensor<string, []>("attn_output_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_5_transpose_y_0 = const()[name = tensor<string, []>("attn_output_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 196, 64]> value_3_cast_fp16 = transpose(perm = value_3_perm_0, x = var_151_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [1, 12, 196, 64]> attn_output_5_cast_fp16 = matmul(transpose_x = attn_output_5_transpose_x_0, transpose_y = attn_output_5_transpose_y_0, x = softmax_1_cast_fp16, y = value_3_cast_fp16)[name = tensor<string, []>("attn_output_5_cast_fp16")];
            tensor<int32, [4]> var_154_perm_0 = const()[name = tensor<string, []>("op_154_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_156 = const()[name = tensor<string, []>("op_156"), val = tensor<int32, [3]>([1, 196, 768])];
            tensor<fp16, [1, 196, 12, 64]> var_154_cast_fp16 = transpose(perm = var_154_perm_0, x = attn_output_5_cast_fp16)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [1, 196, 768]> var_157_cast_fp16 = reshape(shape = var_156, x = var_154_cast_fp16)[name = tensor<string, []>("op_157_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19206400)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20386112)))];
            tensor<fp16, [1, 196, 768]> linear_9_cast_fp16 = linear(bias = model_vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16, x = var_157_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 196, 768]> input_21_cast_fp16 = add(x = input_17_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<int32, [1]> input_23_axes_0 = const()[name = tensor<string, []>("input_23_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20387712)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20389312)))];
            tensor<fp16, [1, 196, 768]> input_23_cast_fp16 = layer_norm(axes = input_23_axes_0, beta = model_vision_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<fp16, [3072, 768]> model_vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20390912)))];
            tensor<fp16, [3072]> model_vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25109568)))];
            tensor<fp16, [1, 196, 3072]> linear_10_cast_fp16 = linear(bias = model_vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16, weight = model_vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_27_mode_0 = const()[name = tensor<string, []>("input_27_mode_0"), val = tensor<string, []>("TANH_APPROXIMATION")];
            tensor<fp16, [1, 196, 3072]> input_27_cast_fp16 = gelu(mode = input_27_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [768, 3072]> model_vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25115776)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29834432)))];
            tensor<fp16, [1, 196, 768]> linear_11_cast_fp16 = linear(bias = model_vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = model_vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 196, 768]> input_29_cast_fp16 = add(x = input_21_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29836032)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29837632)))];
            tensor<fp16, [1, 196, 768]> hidden_states_13_cast_fp16 = layer_norm(axes = hidden_states_13_axes_0, beta = model_vision_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("hidden_states_13_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29839232)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31018944)))];
            tensor<fp16, [1, 196, 768]> linear_12_cast_fp16 = linear(bias = model_vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31020544)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32200256)))];
            tensor<fp16, [1, 196, 768]> linear_13_cast_fp16 = linear(bias = model_vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32201856)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33381568)))];
            tensor<fp16, [1, 196, 768]> linear_14_cast_fp16 = linear(bias = model_vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<int32, [4]> var_201 = const()[name = tensor<string, []>("op_201"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_202_cast_fp16 = reshape(shape = var_201, x = linear_12_cast_fp16)[name = tensor<string, []>("op_202_cast_fp16")];
            tensor<int32, [4]> var_204 = const()[name = tensor<string, []>("op_204"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_205_cast_fp16 = reshape(shape = var_204, x = linear_13_cast_fp16)[name = tensor<string, []>("op_205_cast_fp16")];
            tensor<int32, [4]> var_207 = const()[name = tensor<string, []>("op_207"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_208_cast_fp16 = reshape(shape = var_207, x = linear_14_cast_fp16)[name = tensor<string, []>("op_208_cast_fp16")];
            tensor<int32, [4]> value_5_perm_0 = const()[name = tensor<string, []>("value_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, 196, 12, 64]> mul_2_cast_fp16 = mul(x = var_202_cast_fp16, y = var_14_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = tensor<string, []>("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 196, 64]> transpose_53 = transpose(perm = transpose_53_perm_0, x = var_205_cast_fp16)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [1, 12, 196, 64]> transpose_52 = transpose(perm = transpose_52_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [1, 12, 196, 196]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_52, y = transpose_53)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 196, 196]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> attn_output_9_transpose_x_0 = const()[name = tensor<string, []>("attn_output_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_9_transpose_y_0 = const()[name = tensor<string, []>("attn_output_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 196, 64]> value_5_cast_fp16 = transpose(perm = value_5_perm_0, x = var_208_cast_fp16)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [1, 12, 196, 64]> attn_output_9_cast_fp16 = matmul(transpose_x = attn_output_9_transpose_x_0, transpose_y = attn_output_9_transpose_y_0, x = softmax_2_cast_fp16, y = value_5_cast_fp16)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<int32, [4]> var_211_perm_0 = const()[name = tensor<string, []>("op_211_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, [3]>([1, 196, 768])];
            tensor<fp16, [1, 196, 12, 64]> var_211_cast_fp16 = transpose(perm = var_211_perm_0, x = attn_output_9_cast_fp16)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [1, 196, 768]> var_214_cast_fp16 = reshape(shape = var_213, x = var_211_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33383168)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34562880)))];
            tensor<fp16, [1, 196, 768]> linear_15_cast_fp16 = linear(bias = model_vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16, x = var_214_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, 196, 768]> input_33_cast_fp16 = add(x = input_29_cast_fp16, y = linear_15_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<int32, [1]> input_35_axes_0 = const()[name = tensor<string, []>("input_35_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34564480)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34566080)))];
            tensor<fp16, [1, 196, 768]> input_35_cast_fp16 = layer_norm(axes = input_35_axes_0, beta = model_vision_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<fp16, [3072, 768]> model_vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34567680)))];
            tensor<fp16, [3072]> model_vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39286336)))];
            tensor<fp16, [1, 196, 3072]> linear_16_cast_fp16 = linear(bias = model_vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16, weight = model_vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<string, []> input_39_mode_0 = const()[name = tensor<string, []>("input_39_mode_0"), val = tensor<string, []>("TANH_APPROXIMATION")];
            tensor<fp16, [1, 196, 3072]> input_39_cast_fp16 = gelu(mode = input_39_mode_0, x = linear_16_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<fp16, [768, 3072]> model_vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39292544)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44011200)))];
            tensor<fp16, [1, 196, 768]> linear_17_cast_fp16 = linear(bias = model_vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16, weight = model_vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 196, 768]> input_41_cast_fp16 = add(x = input_33_cast_fp16, y = linear_17_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> hidden_states_19_axes_0 = const()[name = tensor<string, []>("hidden_states_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vision_model_encoder_layers_3_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_layer_norm1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44012800)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_3_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_layer_norm1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44014400)))];
            tensor<fp16, [1, 196, 768]> hidden_states_19_cast_fp16 = layer_norm(axes = hidden_states_19_axes_0, beta = model_vision_model_encoder_layers_3_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vision_model_encoder_layers_3_layer_norm1_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("hidden_states_19_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44016000)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45195712)))];
            tensor<fp16, [1, 196, 768]> linear_18_cast_fp16 = linear(bias = model_vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16, x = hidden_states_19_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45197312)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46377024)))];
            tensor<fp16, [1, 196, 768]> linear_19_cast_fp16 = linear(bias = model_vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16, x = hidden_states_19_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<fp16, [768, 768]> model_vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46378624)))];
            tensor<fp16, [768]> model_vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("model_vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47558336)))];
            tensor<fp16, [1, 196, 768]> linear_20_cast_fp16 = linear(bias = model_vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16, weight = model_vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16, x = hidden_states_19_cast_fp16)[name = tensor<string, []>("linear_20_cast_fp16")];
            tensor<int32, [4]> var_258 = const()[name = tensor<string, []>("op_258"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_259_cast_fp16 = reshape(shape = var_258, x = linear_18_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<int32, [4]> var_261 = const()[name = tensor<string, []>("op_261"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_262_cast_fp16 = reshape(shape = var_261, x = linear_19_cast_fp16)[name = tensor<string, []>("op_262_cast_fp16")];
            tensor<int32, [4]> var_264 = const()[name = tensor<string, []>("op_264"), val = tensor<int32, [4]>([1, 196, 12, 64])];
            tensor<fp16, [1, 196, 12, 64]> var_265_cast_fp16 = reshape(shape = var_264, x = linear_20_cast_fp16)[name = tensor<string, []>("op_265_cast_fp16")];
            tensor<int32, [4]> value_7_perm_0 = const()[name = tensor<string, []>("value_7_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, 196, 12, 64]> mul_3_cast_fp16 = mul(x = var_259_cast_fp16, y = var_14_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_54_perm_0 = const()[name = tensor<string, []>("transpose_54_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_55_perm_0 = const()[name = tensor<string, []>("transpose_55_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 196, 64]> transpose_55 = transpose(perm = transpose_55_perm_0, x = var_262_cast_fp16)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 12, 196, 64]> transpose_54 = transpose(perm = transpose_54_perm_0, x = mul_3_cast_fp16)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [1, 12, 196, 196]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_54, y = transpose_55)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, []> softmax_3_axis_0 = const()[name = tensor<string, []>("softmax_3_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 196, 196]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = tensor<string, []>("softmax_3_cast_fp16")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
