program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.9.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp32, [1, 3, 224, 224]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 224, 224]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> image__biased___y_0 = const()[name = tensor<string, []>("image__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1p-1]], [[-0x1p-1]], [[-0x1p-1]]]])];
            tensor<fp32, [1, 3, 224, 224]> image__biased__ = add(x = image__scaled__, y = image__biased___y_0)[name = tensor<string, []>("image__biased__")];
            tensor<int32, []> var_7 = const()[name = tensor<string, []>("op_7"), val = tensor<int32, []>(1)];
            tensor<string, []> var_35_pad_type_0 = const()[name = tensor<string, []>("op_35_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> var_35_strides_0 = const()[name = tensor<string, []>("op_35_strides_0"), val = tensor<int32, [2]>([16, 16])];
            tensor<int32, [4]> var_35_pad_0 = const()[name = tensor<string, []>("op_35_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> var_35_dilations_0 = const()[name = tensor<string, []>("op_35_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_35_groups_0 = const()[name = tensor<string, []>("op_35_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [768, 3, 16, 16]> model_vit_embeddings_patch_embeddings_projection_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_embeddings_patch_embeddings_projection_weight_to_fp16"), val = tensor<fp16, [768, 3, 16, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [768]> model_vit_embeddings_patch_embeddings_projection_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_embeddings_patch_embeddings_projection_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1179776)))];
            tensor<fp16, [1, 3, 224, 224]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__biased__)[name = tensor<string, []>("cast_50")];
            tensor<fp16, [1, 768, 14, 14]> var_35_cast_fp16 = conv(bias = model_vit_embeddings_patch_embeddings_projection_bias_to_fp16, dilations = var_35_dilations_0, groups = var_35_groups_0, pad = var_35_pad_0, pad_type = var_35_pad_type_0, strides = var_35_strides_0, weight = model_vit_embeddings_patch_embeddings_projection_weight_to_fp16, x = image_to_fp16)[name = tensor<string, []>("op_35_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 768, 196])];
            tensor<fp16, [1, 768, 196]> var_36_cast_fp16 = reshape(shape = concat_0, x = var_35_cast_fp16)[name = tensor<string, []>("op_36_cast_fp16")];
            tensor<int32, [3]> embeddings_1_perm_0 = const()[name = tensor<string, []>("embeddings_1_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> embeddings_3_interleave_0 = const()[name = tensor<string, []>("embeddings_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 768]> model_vit_embeddings_cls_token_to_fp16 = const()[name = tensor<string, []>("model_vit_embeddings_cls_token_to_fp16"), val = tensor<fp16, [1, 1, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1181376)))];
            tensor<fp16, [1, 196, 768]> embeddings_1_cast_fp16 = transpose(perm = embeddings_1_perm_0, x = var_36_cast_fp16)[name = tensor<string, []>("transpose_120")];
            tensor<fp16, [1, 197, 768]> embeddings_3_cast_fp16 = concat(axis = var_7, interleave = embeddings_3_interleave_0, values = (model_vit_embeddings_cls_token_to_fp16, embeddings_1_cast_fp16))[name = tensor<string, []>("embeddings_3_cast_fp16")];
            tensor<fp16, [1, 197, 768]> model_vit_embeddings_position_embeddings_to_fp16 = const()[name = tensor<string, []>("model_vit_embeddings_position_embeddings_to_fp16"), val = tensor<fp16, [1, 197, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1182976)))];
            tensor<fp16, [1, 197, 768]> input_1_cast_fp16 = add(x = embeddings_3_cast_fp16, y = model_vit_embeddings_position_embeddings_to_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_0_layernorm_before_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_layernorm_before_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1485632)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_layernorm_before_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_layernorm_before_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1487232)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 197, 768]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = model_vit_encoder_layer_0_layernorm_before_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_0_layernorm_before_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_0_attention_attention_key_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1488832)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_attention_attention_key_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2668544)))];
            tensor<fp16, [1, 197, 768]> linear_0_cast_fp16 = linear(bias = model_vit_encoder_layer_0_attention_attention_key_bias_to_fp16, weight = model_vit_encoder_layer_0_attention_attention_key_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<int32, [4]> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_87_cast_fp16 = reshape(shape = var_86, x = linear_0_cast_fp16)[name = tensor<string, []>("op_87_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_0_attention_attention_value_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2670144)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_attention_attention_value_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3849856)))];
            tensor<fp16, [1, 197, 768]> linear_1_cast_fp16 = linear(bias = model_vit_encoder_layer_0_attention_attention_value_bias_to_fp16, weight = model_vit_encoder_layer_0_attention_attention_value_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<int32, [4]> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_93_cast_fp16 = reshape(shape = var_92, x = linear_1_cast_fp16)[name = tensor<string, []>("op_93_cast_fp16")];
            tensor<int32, [4]> value_1_perm_0 = const()[name = tensor<string, []>("value_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_0_attention_attention_query_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3851456)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_attention_attention_query_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5031168)))];
            tensor<fp16, [1, 197, 768]> linear_2_cast_fp16 = linear(bias = model_vit_encoder_layer_0_attention_attention_query_bias_to_fp16, weight = model_vit_encoder_layer_0_attention_attention_query_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_98 = const()[name = tensor<string, []>("op_98"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_99_cast_fp16 = reshape(shape = var_98, x = linear_2_cast_fp16)[name = tensor<string, []>("op_99_cast_fp16")];
            tensor<fp16, []> var_17_to_fp16 = const()[name = tensor<string, []>("op_17_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 197, 12, 64]> mul_0_cast_fp16 = mul(x = var_99_cast_fp16, y = var_17_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_48_perm_0 = const()[name = tensor<string, []>("transpose_48_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_49_perm_0 = const()[name = tensor<string, []>("transpose_49_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 197, 64]> transpose_49 = transpose(perm = transpose_49_perm_0, x = var_87_cast_fp16)[name = tensor<string, []>("transpose_117")];
            tensor<fp16, [1, 12, 197, 64]> transpose_48 = transpose(perm = transpose_48_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_118")];
            tensor<fp16, [1, 12, 197, 197]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_48, y = transpose_49)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 197, 197]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 197, 64]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_93_cast_fp16)[name = tensor<string, []>("transpose_119")];
            tensor<fp16, [1, 12, 197, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = softmax_0_cast_fp16, y = value_1_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_102_perm_0 = const()[name = tensor<string, []>("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, [3]>([1, 197, 768])];
            tensor<fp16, [1, 197, 12, 64]> var_102_cast_fp16 = transpose(perm = var_102_perm_0, x = attn_output_1_cast_fp16)[name = tensor<string, []>("transpose_116")];
            tensor<fp16, [1, 197, 768]> input_5_cast_fp16 = reshape(shape = var_106, x = var_102_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_0_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5032768)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6212480)))];
            tensor<fp16, [1, 197, 768]> linear_3_cast_fp16 = linear(bias = model_vit_encoder_layer_0_attention_output_dense_bias_to_fp16, weight = model_vit_encoder_layer_0_attention_output_dense_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 197, 768]> input_9_cast_fp16 = add(x = linear_3_cast_fp16, y = input_1_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<int32, [1]> input_11_axes_0 = const()[name = tensor<string, []>("input_11_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_0_layernorm_after_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_layernorm_after_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6214080)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_layernorm_after_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_layernorm_after_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6215680)))];
            tensor<fp16, [1, 197, 768]> input_11_cast_fp16 = layer_norm(axes = input_11_axes_0, beta = model_vit_encoder_layer_0_layernorm_after_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_0_layernorm_after_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [3072, 768]> model_vit_encoder_layer_0_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6217280)))];
            tensor<fp16, [3072]> model_vit_encoder_layer_0_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10935936)))];
            tensor<fp16, [1, 197, 3072]> linear_4_cast_fp16 = linear(bias = model_vit_encoder_layer_0_intermediate_dense_bias_to_fp16, weight = model_vit_encoder_layer_0_intermediate_dense_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<string, []> input_15_mode_0 = const()[name = tensor<string, []>("input_15_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 197, 3072]> input_15_cast_fp16 = gelu(mode = input_15_mode_0, x = linear_4_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<fp16, [768, 3072]> model_vit_encoder_layer_0_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10942144)))];
            tensor<fp16, [768]> model_vit_encoder_layer_0_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_0_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15660800)))];
            tensor<fp16, [1, 197, 768]> linear_5_cast_fp16 = linear(bias = model_vit_encoder_layer_0_output_dense_bias_to_fp16, weight = model_vit_encoder_layer_0_output_dense_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, 197, 768]> input_19_cast_fp16 = add(x = linear_5_cast_fp16, y = input_9_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [1]> hidden_states_5_axes_0 = const()[name = tensor<string, []>("hidden_states_5_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_1_layernorm_before_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_layernorm_before_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15662400)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_layernorm_before_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_layernorm_before_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15664000)))];
            tensor<fp16, [1, 197, 768]> hidden_states_5_cast_fp16 = layer_norm(axes = hidden_states_5_axes_0, beta = model_vit_encoder_layer_1_layernorm_before_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_1_layernorm_before_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("hidden_states_5_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_1_attention_attention_key_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15665600)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_attention_attention_key_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16845312)))];
            tensor<fp16, [1, 197, 768]> linear_6_cast_fp16 = linear(bias = model_vit_encoder_layer_1_attention_attention_key_bias_to_fp16, weight = model_vit_encoder_layer_1_attention_attention_key_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<int32, [4]> var_147 = const()[name = tensor<string, []>("op_147"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_148_cast_fp16 = reshape(shape = var_147, x = linear_6_cast_fp16)[name = tensor<string, []>("op_148_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_1_attention_attention_value_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16846912)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_attention_attention_value_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18026624)))];
            tensor<fp16, [1, 197, 768]> linear_7_cast_fp16 = linear(bias = model_vit_encoder_layer_1_attention_attention_value_bias_to_fp16, weight = model_vit_encoder_layer_1_attention_attention_value_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<int32, [4]> var_153 = const()[name = tensor<string, []>("op_153"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_154_cast_fp16 = reshape(shape = var_153, x = linear_7_cast_fp16)[name = tensor<string, []>("op_154_cast_fp16")];
            tensor<int32, [4]> value_3_perm_0 = const()[name = tensor<string, []>("value_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_1_attention_attention_query_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18028224)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_attention_attention_query_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19207936)))];
            tensor<fp16, [1, 197, 768]> linear_8_cast_fp16 = linear(bias = model_vit_encoder_layer_1_attention_attention_query_bias_to_fp16, weight = model_vit_encoder_layer_1_attention_attention_query_weight_to_fp16, x = hidden_states_5_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [4]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_160_cast_fp16 = reshape(shape = var_159, x = linear_8_cast_fp16)[name = tensor<string, []>("op_160_cast_fp16")];
            tensor<fp16, [1, 197, 12, 64]> mul_1_cast_fp16 = mul(x = var_160_cast_fp16, y = var_17_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_50_perm_0 = const()[name = tensor<string, []>("transpose_50_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_51_perm_0 = const()[name = tensor<string, []>("transpose_51_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 197, 64]> transpose_51 = transpose(perm = transpose_51_perm_0, x = var_148_cast_fp16)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [1, 12, 197, 64]> transpose_50 = transpose(perm = transpose_50_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [1, 12, 197, 197]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_50, y = transpose_51)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 197, 197]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> attn_output_3_transpose_x_0 = const()[name = tensor<string, []>("attn_output_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_3_transpose_y_0 = const()[name = tensor<string, []>("attn_output_3_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 197, 64]> value_3_cast_fp16 = transpose(perm = value_3_perm_0, x = var_154_cast_fp16)[name = tensor<string, []>("transpose_115")];
            tensor<fp16, [1, 12, 197, 64]> attn_output_3_cast_fp16 = matmul(transpose_x = attn_output_3_transpose_x_0, transpose_y = attn_output_3_transpose_y_0, x = softmax_1_cast_fp16, y = value_3_cast_fp16)[name = tensor<string, []>("attn_output_3_cast_fp16")];
            tensor<int32, [4]> var_163_perm_0 = const()[name = tensor<string, []>("op_163_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_167 = const()[name = tensor<string, []>("op_167"), val = tensor<int32, [3]>([1, 197, 768])];
            tensor<fp16, [1, 197, 12, 64]> var_163_cast_fp16 = transpose(perm = var_163_perm_0, x = attn_output_3_cast_fp16)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [1, 197, 768]> input_21_cast_fp16 = reshape(shape = var_167, x = var_163_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_1_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(19209536)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20389248)))];
            tensor<fp16, [1, 197, 768]> linear_9_cast_fp16 = linear(bias = model_vit_encoder_layer_1_attention_output_dense_bias_to_fp16, weight = model_vit_encoder_layer_1_attention_output_dense_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 197, 768]> input_25_cast_fp16 = add(x = linear_9_cast_fp16, y = input_19_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<int32, [1]> input_27_axes_0 = const()[name = tensor<string, []>("input_27_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_1_layernorm_after_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_layernorm_after_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20390848)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_layernorm_after_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_layernorm_after_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20392448)))];
            tensor<fp16, [1, 197, 768]> input_27_cast_fp16 = layer_norm(axes = input_27_axes_0, beta = model_vit_encoder_layer_1_layernorm_after_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_1_layernorm_after_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<fp16, [3072, 768]> model_vit_encoder_layer_1_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20394048)))];
            tensor<fp16, [3072]> model_vit_encoder_layer_1_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25112704)))];
            tensor<fp16, [1, 197, 3072]> linear_10_cast_fp16 = linear(bias = model_vit_encoder_layer_1_intermediate_dense_bias_to_fp16, weight = model_vit_encoder_layer_1_intermediate_dense_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_31_mode_0 = const()[name = tensor<string, []>("input_31_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 197, 3072]> input_31_cast_fp16 = gelu(mode = input_31_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<fp16, [768, 3072]> model_vit_encoder_layer_1_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25118912)))];
            tensor<fp16, [768]> model_vit_encoder_layer_1_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_1_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29837568)))];
            tensor<fp16, [1, 197, 768]> linear_11_cast_fp16 = linear(bias = model_vit_encoder_layer_1_output_dense_bias_to_fp16, weight = model_vit_encoder_layer_1_output_dense_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 197, 768]> input_35_cast_fp16 = add(x = linear_11_cast_fp16, y = input_25_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [1]> hidden_states_9_axes_0 = const()[name = tensor<string, []>("hidden_states_9_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_2_layernorm_before_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_layernorm_before_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29839168)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_layernorm_before_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_layernorm_before_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29840768)))];
            tensor<fp16, [1, 197, 768]> hidden_states_9_cast_fp16 = layer_norm(axes = hidden_states_9_axes_0, beta = model_vit_encoder_layer_2_layernorm_before_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_2_layernorm_before_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("hidden_states_9_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_2_attention_attention_key_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29842368)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_attention_attention_key_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31022080)))];
            tensor<fp16, [1, 197, 768]> linear_12_cast_fp16 = linear(bias = model_vit_encoder_layer_2_attention_attention_key_bias_to_fp16, weight = model_vit_encoder_layer_2_attention_attention_key_weight_to_fp16, x = hidden_states_9_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<int32, [4]> var_208 = const()[name = tensor<string, []>("op_208"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_209_cast_fp16 = reshape(shape = var_208, x = linear_12_cast_fp16)[name = tensor<string, []>("op_209_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_2_attention_attention_value_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31023680)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_attention_attention_value_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32203392)))];
            tensor<fp16, [1, 197, 768]> linear_13_cast_fp16 = linear(bias = model_vit_encoder_layer_2_attention_attention_value_bias_to_fp16, weight = model_vit_encoder_layer_2_attention_attention_value_weight_to_fp16, x = hidden_states_9_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<int32, [4]> var_214 = const()[name = tensor<string, []>("op_214"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_215_cast_fp16 = reshape(shape = var_214, x = linear_13_cast_fp16)[name = tensor<string, []>("op_215_cast_fp16")];
            tensor<int32, [4]> value_5_perm_0 = const()[name = tensor<string, []>("value_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_2_attention_attention_query_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(32204992)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_attention_attention_query_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33384704)))];
            tensor<fp16, [1, 197, 768]> linear_14_cast_fp16 = linear(bias = model_vit_encoder_layer_2_attention_attention_query_bias_to_fp16, weight = model_vit_encoder_layer_2_attention_attention_query_weight_to_fp16, x = hidden_states_9_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<int32, [4]> var_220 = const()[name = tensor<string, []>("op_220"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_221_cast_fp16 = reshape(shape = var_220, x = linear_14_cast_fp16)[name = tensor<string, []>("op_221_cast_fp16")];
            tensor<fp16, [1, 197, 12, 64]> mul_2_cast_fp16 = mul(x = var_221_cast_fp16, y = var_17_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_52_perm_0 = const()[name = tensor<string, []>("transpose_52_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_53_perm_0 = const()[name = tensor<string, []>("transpose_53_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 197, 64]> transpose_53 = transpose(perm = transpose_53_perm_0, x = var_209_cast_fp16)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [1, 12, 197, 64]> transpose_52 = transpose(perm = transpose_52_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [1, 12, 197, 197]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_52, y = transpose_53)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 197, 197]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> attn_output_5_transpose_x_0 = const()[name = tensor<string, []>("attn_output_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_5_transpose_y_0 = const()[name = tensor<string, []>("attn_output_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, 197, 64]> value_5_cast_fp16 = transpose(perm = value_5_perm_0, x = var_215_cast_fp16)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [1, 12, 197, 64]> attn_output_5_cast_fp16 = matmul(transpose_x = attn_output_5_transpose_x_0, transpose_y = attn_output_5_transpose_y_0, x = softmax_2_cast_fp16, y = value_5_cast_fp16)[name = tensor<string, []>("attn_output_5_cast_fp16")];
            tensor<int32, [4]> var_224_perm_0 = const()[name = tensor<string, []>("op_224_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [3]>([1, 197, 768])];
            tensor<fp16, [1, 197, 12, 64]> var_224_cast_fp16 = transpose(perm = var_224_perm_0, x = attn_output_5_cast_fp16)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [1, 197, 768]> input_37_cast_fp16 = reshape(shape = var_228, x = var_224_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_2_attention_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33386304)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_attention_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_attention_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34566016)))];
            tensor<fp16, [1, 197, 768]> linear_15_cast_fp16 = linear(bias = model_vit_encoder_layer_2_attention_output_dense_bias_to_fp16, weight = model_vit_encoder_layer_2_attention_output_dense_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, 197, 768]> input_41_cast_fp16 = add(x = linear_15_cast_fp16, y = input_35_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<int32, [1]> input_43_axes_0 = const()[name = tensor<string, []>("input_43_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_2_layernorm_after_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_layernorm_after_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34567616)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_layernorm_after_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_layernorm_after_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34569216)))];
            tensor<fp16, [1, 197, 768]> input_43_cast_fp16 = layer_norm(axes = input_43_axes_0, beta = model_vit_encoder_layer_2_layernorm_after_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_2_layernorm_after_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<fp16, [3072, 768]> model_vit_encoder_layer_2_intermediate_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_intermediate_dense_weight_to_fp16"), val = tensor<fp16, [3072, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(34570816)))];
            tensor<fp16, [3072]> model_vit_encoder_layer_2_intermediate_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_intermediate_dense_bias_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39289472)))];
            tensor<fp16, [1, 197, 3072]> linear_16_cast_fp16 = linear(bias = model_vit_encoder_layer_2_intermediate_dense_bias_to_fp16, weight = model_vit_encoder_layer_2_intermediate_dense_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<string, []> input_47_mode_0 = const()[name = tensor<string, []>("input_47_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 197, 3072]> input_47_cast_fp16 = gelu(mode = input_47_mode_0, x = linear_16_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<fp16, [768, 3072]> model_vit_encoder_layer_2_output_dense_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_output_dense_weight_to_fp16"), val = tensor<fp16, [768, 3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39295680)))];
            tensor<fp16, [768]> model_vit_encoder_layer_2_output_dense_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_2_output_dense_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44014336)))];
            tensor<fp16, [1, 197, 768]> linear_17_cast_fp16 = linear(bias = model_vit_encoder_layer_2_output_dense_bias_to_fp16, weight = model_vit_encoder_layer_2_output_dense_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 197, 768]> input_51_cast_fp16 = add(x = linear_17_cast_fp16, y = input_41_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> model_vit_encoder_layer_3_layernorm_before_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_layernorm_before_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44015936)))];
            tensor<fp16, [768]> model_vit_encoder_layer_3_layernorm_before_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_layernorm_before_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44017536)))];
            tensor<fp16, [1, 197, 768]> hidden_states_13_cast_fp16 = layer_norm(axes = hidden_states_13_axes_0, beta = model_vit_encoder_layer_3_layernorm_before_bias_to_fp16, epsilon = var_12_to_fp16, gamma = model_vit_encoder_layer_3_layernorm_before_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("hidden_states_13_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_3_attention_attention_key_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_attention_attention_key_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44019136)))];
            tensor<fp16, [768]> model_vit_encoder_layer_3_attention_attention_key_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_attention_attention_key_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45198848)))];
            tensor<fp16, [1, 197, 768]> linear_18_cast_fp16 = linear(bias = model_vit_encoder_layer_3_attention_attention_key_bias_to_fp16, weight = model_vit_encoder_layer_3_attention_attention_key_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<int32, [4]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_270_cast_fp16 = reshape(shape = var_269, x = linear_18_cast_fp16)[name = tensor<string, []>("op_270_cast_fp16")];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_3_attention_attention_value_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_attention_attention_value_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(45200448)))];
            tensor<fp16, [768]> model_vit_encoder_layer_3_attention_attention_value_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_attention_attention_value_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46380160)))];
            tensor<fp16, [1, 197, 768]> linear_19_cast_fp16 = linear(bias = model_vit_encoder_layer_3_attention_attention_value_bias_to_fp16, weight = model_vit_encoder_layer_3_attention_attention_value_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<int32, [4]> var_275 = const()[name = tensor<string, []>("op_275"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_276_cast_fp16 = reshape(shape = var_275, x = linear_19_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<int32, [4]> value_7_perm_0 = const()[name = tensor<string, []>("value_7_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [768, 768]> model_vit_encoder_layer_3_attention_attention_query_weight_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_attention_attention_query_weight_to_fp16"), val = tensor<fp16, [768, 768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46381760)))];
            tensor<fp16, [768]> model_vit_encoder_layer_3_attention_attention_query_bias_to_fp16 = const()[name = tensor<string, []>("model_vit_encoder_layer_3_attention_attention_query_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47561472)))];
            tensor<fp16, [1, 197, 768]> linear_20_cast_fp16 = linear(bias = model_vit_encoder_layer_3_attention_attention_query_bias_to_fp16, weight = model_vit_encoder_layer_3_attention_attention_query_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_20_cast_fp16")];
            tensor<int32, [4]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, 197, 12, 64]> var_282_cast_fp16 = reshape(shape = var_281, x = linear_20_cast_fp16)[name = tensor<string, []>("op_282_cast_fp16")];
            tensor<fp16, [1, 197, 12, 64]> mul_3_cast_fp16 = mul(x = var_282_cast_fp16, y = var_17_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_54_perm_0 = const()[name = tensor<string, []>("transpose_54_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_55_perm_0 = const()[name = tensor<string, []>("transpose_55_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 12, 197, 64]> transpose_55 = transpose(perm = transpose_55_perm_0, x = var_270_cast_fp16)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 12, 197, 64]> transpose_54 = transpose(perm = transpose_54_perm_0, x = mul_3_cast_fp16)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [1, 12, 197, 197]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_54, y = transpose_55)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, []> softmax_3_axis_0 = const()[name = tensor<string, []>("softmax_3_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 12, 197, 197]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = tensor<string, []>("softmax_3_cast_fp16")];
